MyQuote/app/controllers/home_controller.rb

  def index
    #OpenAI.(2024).Quote included snippet of code [AI-generated .txt file]. Generated using ChatGPT, provided by OpenAI.
    @recentquotes = Quote.includes(:philosopher).order(created_at: :desc).limit(5)
---
SELECT "philosophers".* FROM "philosophers" WHERE "philosophers"."id" IN (?, ?, ?, ?, ?)  [["id", 11], ["id", 12], ["id", 10], ["id", 9], ["id", 8]]
SELECT "quotes".* FROM "quotes" ORDER BY "quotes"."created_at" DESC LIMIT ?  [["LIMIT", 5]]

  def urquotes
    @quotes = Quote.includes(:philosopher).where(user_id: session[:user_id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."user_id" = ?  [["user_id", 1]]