MyQuote/app/controllers/quotes_controller.rb

    def set_quote
      @quote = Quote.find(params[:id])
---
SELECT "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]