MyQuote/app/controllers/search_controller.rb

  def index
    category_query = params[:category_query]
if category_query.present?
@quotesmatch = Quote.joins(:quotecategories, :categories)
.where("categories.cat_name LIKE ?", "%#{category_query}%").distinct
---
SELECT DISTINCT "quotes".* FROM "quotes" INNER JOIN "quotecategories" ON "quotecategories"."quote_id" = "quotes"."id" INNER JOIN "quotecategories" "quotecategories_quotes_join" ON "quotecategories_quotes_join"."quote_id" = "quotes"."id" INNER JOIN "categories" ON "categories"."id" = "quotecategories_quotes_join"."category_id" WHERE (categories.cat_name LIKE '%Logic%')