MyQuote/app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
  # @users = User.all (comment this line out and replace as follows)
  # if there is a logged in user and that user is the administrator
  if logged_in? && is_administrator?
  @users = User.all # then retrieve all users from the database

INSERT INTO "users" ("fname", "surname", "email", "IsAdmin", "password_digest", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password_digest", "[FILTERED]"], ["updated_at", "2024-10-16 13:02:51.396022"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)